//*****************************************************************************
// メイン処理[main.h]
//*****************************************************************************
#pragma once

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <windows.h>
#include <d3d11.h>
#include <d3dx11.h>
#include <d3dcompiler.h>
#include <xnamath.h>

//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************
#pragma comment (lib, "d3d11.lib")		
#pragma comment (lib, "d3dcompiler.lib")
#pragma comment (lib, "d3dx11d.lib")	

//*****************************************************************************
// 定数定義
//*****************************************************************************
constexpr auto ScreenWidth = 800;
constexpr auto ScreenHeight = 600;

//*****************************************************************************
// マクロ定義
//*****************************************************************************
// メモリリーク検出
#ifdef _DEBUG
#ifndef DBG_NEW
#include <crtdbg.h>
#define DBG_NEW new(_NORMAL_BLOCK, __FILE__, __LINE__)
#define	new DBG_NEW
#endif
#endif

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct Vertex3D
{
	XMFLOAT3 Position;
	XMFLOAT2 TexCoord;
	XMFLOAT4 Color;
	XMFLOAT3 Normal;
};

struct ConstantBuffer
{
	XMMATRIX World;
	XMMATRIX WorldViewProjection;
	XMFLOAT3 DirectionalLight;
};