//*****************************************************************************
// 描画インターフェース[IDrawable.h]
//*****************************************************************************
#pragma once

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// クラス宣言
//*****************************************************************************
class IDrawable
{
public:

	//=============================================================================
	// デストラクタ
	//=============================================================================
	virtual ~IDrawable(){}

	//=============================================================================
	// 描画処理
	// pContext : デバイスコンテキスト
	// pVertexShader : 頂点シェーダー
	// pPixelShader : ピクセルシェーダー
	// pLayout : 頂点レイアウト
	// pConstantBuffer : 定数バッファ
	// viewProjection : ビュープロジェクション行列
	//=============================================================================
	virtual void Draw(ID3D11DeviceContext * pContext, ID3D11VertexShader * pVertexShader,
		ID3D11PixelShader * pPixelShader, ID3D11InputLayout * pLayout, ID3D11Buffer * pConstantBuffer, const XMMATRIX& viewProjection) = 0;
};